"""
@Author  : 韩昊
@Company : 天津电子信息职业技术学院
@Date    :   2026/9/1 14:00
@Desc    :
@Version : 1.0
"""



print("hello world")
#单引号
#双引号和单引号均可用于表达字符串 在功能没有太大差异 两者唯一的实际差异是当字符串内容本身包含引号时，可以避免转义：
print(2+3)

print("2+3")
#引号中的内容会原封不动的输出(打印),本质上是字符串

# 单双引用的使用场景
print("what's your name?")
print('张三说:"我喜欢编程!"')

#转义字符
print('what \'s your name?')
#'\是转义字符 是在告诉python 这个单引号是字符串内容，不是结束符

#换行符
print("张三说: \n\"我喜欢编程\"")
#\n是换行符(LF:Line Feed) 这里Python里表示“换行”的标准方式
print('第一行\n\'第二行\'')
#若换行的内容需要引号 则格式为 \n\"(输入文本内容)\" or "\n\"(输入文本内容)\""

#制表符
print("张三李四王五")
print("张三\t\t李四\t\t王五")
#制表符是\t  作用是跳到下一个制表位 非固定宽度 缩进永远用4个空格 别用Tab

#练习
print("20260101\t\t韩昊\t\t男\t\t25\t\t100\t\t是")
print("S001\t光尘\t\t男\t\t18\t\t9\t\tTrue")